# This script includes:
1. Create data to experiment on
2. Concatenate dataframes
3. Merge data
4. Importing Instacart Data Files and Merging

# 1. Create Data to experiment on

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os

In [3]:
# Define a dictionary containing January 2020 dsta
data1={'customer_id':['6732','767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

In [5]:
data1  #Printing data1

{'customer_id': ['6732', '767', '890', '635'],
 'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
 'purchased_meat': [0, 13, 3, 4],
 'purchased_alcohol': [1, 2, 10, 0],
 'purchased_snacks': [10, 5, 1, 7]}

In [7]:
# Define a dictionary containing February 2020 data
data2 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

In [9]:
data2 #printing data2

{'customer_id': ['6732', '767', '890', '635'],
 'month': ['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
 'purchased_meat': [0, 10, 5, 3],
 'purchased_alcohol': [2, 4, 14, 0],
 'purchased_snacks': [15, 3, 2, 6]}

In [11]:
#Convert the dictionary into dataframe
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
df_1 = pd.DataFrame(data2,index=[0, 1, 2, 3])

In [13]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [15]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

# 2. Concatenate dataframes

In [18]:
frames = [df, df_1]
df_concat = pd.concat(frames) # Without mentioning the axis=1, the concate dataframe will be created in a long-format dataframe, meaning it will stack new rows after the existing rows.

In [20]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [22]:
df_concat = pd.concat(frames,axis=1) #creating a wide-format dataframe

In [24]:
df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

# 3. Merge data

In [27]:
# Creating new data dictionary
data3 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'days_purchased_on':[0, 10, 4, 1]}

In [29]:
#Creating new dataframe with data3 dictionary
df_2 = pd.DataFrame(data3,index=[0, 1, 2, 3])

In [31]:
# Merging df on df_2 and creating new dataframe "df_merged".
df_merged=df.merge(df_2, on ='customer_id')

In [33]:
df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,10
2,890,Jan-20,3,10,1,Jan-20,4
3,635,Jan-20,4,0,7,Jan-20,1

In [35]:
df_merged=df.merge(df_2, on= ['customer_id','month']) # Defining month as a joining link as well.

In [37]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,10
2,890,Jan-20,3,10,1,4
3,635,Jan-20,4,0,7,1

In [39]:
# Adding "indicator=True" argument to see whether the merge is a full match, or left-only match or right-only match.
df_merged = df.merge(df_2, on = ['customer_id', 'month'], indicator = True)

In [41]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,10,both
2,890,Jan-20,3,10,1,4,both
3,635,Jan-20,4,0,7,1,both

The "indicator=True" argument added "_merge" column to the dataframe and since its result is both that means this is a full match.

In [44]:
# Test merge without overwriting
pd.merge(df,df_2, on = ['customer_id', 'month'], indicator = True)

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,10,both
2,890,Jan-20,3,10,1,4,both
3,635,Jan-20,4,0,7,1,both

# 4. Importing Instacart Data Files and Merging

In [47]:
path= r'/Users/navneetjha/Desktop/Career foundry Docs/exercises/Data Immersion /Achievement 4/INSTACART BASKET ANALYSIS JULY14-2024'

In [49]:
path

'/Users/navneetjha/Desktop/Career foundry Docs/exercises/Data Immersion /Achievement 4/INSTACART BASKET ANALYSIS JULY14-2024'

In [51]:
df_orders_product_prior=pd.read_csv(os.path.join(path, '02 DATA', 'ORIGINAL', 'Raw', 'orders_products_prior.csv'), index_col = False)

In [55]:
df_orders_product_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [57]:
df_ords=pd.read_csv(os.path.join(path, '02 DATA', 'PREPARED DATA', 'orders_checked.csv'), index_col = False)

In [59]:
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,prior,1,2,8,NaN
1,1,1,2398795,1,prior,2,3,7,15.0
2,2,2,473747,1,prior,3,3,12,21.0
3,3,3,2254736,1,prior,4,4,7,29.0
4,4,4,431534,1,prior,5,4,15,28.0

In [61]:
df_orders_product_prior.shape

(32434489, 4)

In [63]:
df_ords.shape

(3421083, 9)

In [86]:
# Merging "df_ords" with "df_orders_product_prior"
df_merged_large = df_ords.merge(df_orders_product_prior, on = 'order_id', indicator = True)

In [88]:
df_merged_large.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,prior,1,2,8,NaN,26405,5,0,both

In [105]:
df_merged_large.shape

(32434489, 13)

In [94]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [96]:
# Export data to pkl
df_merged_large.to_pickle(os.path.join(path, '02 DATA', 'PREPARED DATA', 'orders_products_combined.pkl'))